Revit 2027 API
Transform1D.Determinant Property
 The determinant of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
public:
property double Determinant {
	double get ();
}
member Determinant : float with get
Property Value
Double
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace